Revit 2026 API

# ApplicationNewCategorySet Method

---

Creates a new instance of a set specifically for holding category objects.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CategorySet NewCategorySet()
```
```vb
Public Function NewCategorySet As CategorySet
```
```cpp
public:
CategorySet^ NewCategorySet()
```
```fsharp
member NewCategorySet : unit -> CategorySet
```

#### Return Value

CategorySetA new instance of a Category Set.

This type of set is used during the creation of instance and type bindings.

#### Reference

Application Class

Autodesk.Revit.Creation Namespace